
## Plan Result




<pre><code>Plan: 3 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.redis_connection_string
  * module.redis-activity-service.azurerm_redis_cache.redis
  * module.redis-activity-service.azurerm_resource_group.cache-resourcegroup
* Update
  * module.dm_store_storage_account.azurerm_storage_account.storage_account
  * module.vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_connection_string will be created
  + resource "azurerm_key_vault_secret" "redis_connection_string" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat"
      + name           = "activity-redis-password"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.dm_store_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.Storage/storageAccounts/dmstoredocaat"
        name                              = "dmstoredocaat"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
            "Deployment Environment" = "aat"
            "Destroy Me"             = "No"
            "Team Contact"           = "#em-dev-chat"
            "application"            = "evidence-management"
            "businessArea"           = "CFT"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#em-dev-chat"
            "environment"            = "staging"
            "managedBy"              = "Evidence Management"
        }
        # (33 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              - "92.232.105.32",
            ]
            # (3 unchanged attributes hidden)
        }


        # (3 unchanged blocks hidden)
    }

  # module.redis-activity-service.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "ccd-activity-service-aat"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = (known after apply)
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "ccd-activity-service-cache-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + subnet_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-1-aat"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
          + "application"         = "core-case-data"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#ccd-questions-answers"
          + "environment"         = "staging"
          + "managedBy"           = "CCD"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 300
          + maxmemory_delta                 = 200
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 200
        }
    }

  # module.redis-activity-service.azurerm_resource_group.cache-resourcegroup will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ccd-activity-service-cache-aat"
      + tags     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
          + "application"         = "core-case-data"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#ccd-questions-answers"
          + "environment"         = "staging"
          + "managedBy"           = "CCD"
        }
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat|ccd-aat"
        name                       = "ccd-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (1 unchanged block hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.dm_store_storage_account.azurerm_storage_account.storage_account has changed
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.Storage/storageAccounts/dmstoredocaat"
        name                              = "dmstoredocaat"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
            "Deployment Environment" = "aat"
            "Destroy Me"             = "No"
            "Team Contact"           = "#em-dev-chat"
            "application"            = "evidence-management"
            "businessArea"           = "CFT"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#em-dev-chat"
            "environment"            = "staging"
            "managedBy"              = "Evidence Management"
        }
        # (33 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              + "92.232.105.32",
            ]
            # (3 unchanged attributes hidden)
        }


        # (3 unchanged blocks hidden)
    }

  # module.vault.azurerm_key_vault.kv has changed
  ~ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
            # (83 unchanged elements hidden)
            {
                application_id          = ""
                certificate_permissions = [
                    "Get",
                    "List",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                ]
                object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
                secret_permissions      = [
                    "Get",
                    "List",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          ~ {
              ~ certificate_permissions = [
                    # (10 unchanged elements hidden)
                    "DeleteIssuers",
                  + "Recover",
                ]
              ~ key_permissions         = [
                    # (4 unchanged elements hidden)
                    "Delete",
                  + "Recover",
                ]
              ~ secret_permissions      = [
                    # (2 unchanged elements hidden)
                    "Delete",
                  + "Recover",
                ]
                # (4 unchanged elements hidden)
            },
        ]
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat"
        name                            = "ccd-aat"
        tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
            "Destroy Me"          = "No"
            "Team Contact"        = "#ccd-devops"
            "application"         = "core-case-data"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#ccd-questions-answers"
            "environment"         = "staging"
            "managedBy"           = "CCD"
        }
        # (11 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.KeyVault/vaults/ccd-aat|ccd-aat"
        name                       = "ccd-aat"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":145,"Program":"tfcmt","SHA1":"","Vars":{}} -->